In [1]:
from pyspark.sql import SparkSession

### Creating APP

In [2]:
spark = SparkSession.builder \
    .master("local") \
    .appName("PySpark SQL From SQL ZOO") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

### Reading dataset

In [143]:
#Initializing File Type and path for data train
file_type = 'text'
delimeter=','

In [144]:
def load_data(file_type):
    """input type of file "text" or "parquet" and Return pyspark dataframe"""
    if file_type =="text": # use text as file type input
        df = spark.read.option("header", "true") \
                       .option("delimeter",delimeter)\
                       .option("inferSchema", "true") \
                       .csv(path)  #path file that you want import
    else:  
        df= spark.read.parquet("example.parquet") #path file that you want import
    return df

In [145]:
# reading worker dataset
path=r'/home/hasan/DATA SET/PySpark SQL/Student.csv'
student = load_data(file_type)

### Initializing Dataset

In [146]:
student.show()

+---+---------+--------+----------+
| ID|FirstName|LastName|   Address|
+---+---------+--------+----------+
| 34|      Joe|   Kidde| Amsterdam|
| 14|     Bide|     Tom|Kelifornia|
|  4|     Jack|      Ma|  Oklahoma|
| 24|     Dibb|    Dull|  New York|
| 54|      Bob|    Kent|Kelifornia|
| 44|     Hash|   Kient| Manhattan|
| 74|     Joie|    Anti|New Jersey|
| 84|    Biden|  Dirich|    Alaska|
|  4|    Krish|     Roy|Birmingham|
| 94|     Rock| Johnson|    London|
|104|     John|     Die|    8Dhaka|
+---+---------+--------+----------+

In [147]:
student.count()

11

In [148]:
student.printSchema()

root
 |-- ID: integer (nullable = true)
 |-- FirstName: string (nullable = true)
 |-- LastName: string (nullable = true)
 |-- Address: string (nullable = true)

### Converting Dataset to SQL Query

In [149]:
student.createOrReplaceTempView("student_data")

# SQL Question and Answer

### Use of select

In [150]:
# Q1: Write an sql query to show database
spark.sql(" show databases").show()

+---------+
|namespace|
+---------+
|  default|
+---------+

In [151]:
# Q2: Write an sql query to show tables
spark.sql(" show tables ").show()

+--------+------------+-----------+
|database|   tableName|isTemporary|
+--------+------------+-----------+
|        |student_data|       true|
+--------+------------+-----------+

In [152]:
# Q3: write and sql query to show ID and LastName
spark.sql(" select ID, LastName from student_data ").show()

+---+--------+
| ID|LastName|
+---+--------+
| 34|   Kidde|
| 14|     Tom|
|  4|      Ma|
| 24|    Dull|
| 54|    Kent|
| 44|   Kient|
| 74|    Anti|
| 84|  Dirich|
|  4|     Roy|
| 94| Johnson|
|104|     Die|
+---+--------+

In [153]:
# Q4: Write an sql queries to show all the columns and values
spark.sql(" select * from student_data ").show()

+---+---------+--------+----------+
| ID|FirstName|LastName|   Address|
+---+---------+--------+----------+
| 34|      Joe|   Kidde| Amsterdam|
| 14|     Bide|     Tom|Kelifornia|
|  4|     Jack|      Ma|  Oklahoma|
| 24|     Dibb|    Dull|  New York|
| 54|      Bob|    Kent|Kelifornia|
| 44|     Hash|   Kient| Manhattan|
| 74|     Joie|    Anti|New Jersey|
| 84|    Biden|  Dirich|    Alaska|
|  4|    Krish|     Roy|Birmingham|
| 94|     Rock| Johnson|    London|
|104|     John|     Die|    8Dhaka|
+---+---------+--------+----------+

In [154]:
# Q5: Write sql query to show last_name and address in one column
spark.sql(" (select LastName from student_data)\
            union \
            (select Address from student_data) ").show()

+----------+
|  LastName|
+----------+
|    Dirich|
|       Roy|
|Kelifornia|
|       Tom|
|    London|
|Birmingham|
|  Oklahoma|
|    Alaska|
| Amsterdam|
|      Anti|
|        Ma|
|    8Dhaka|
|      Kent|
|     Kient|
|New Jersey|
|     Kidde|
|      Dull|
|   Johnson|
|       Die|
|  New York|
+----------+
only showing top 20 rows

In [155]:
# Q6: Write sql query to show unique first_name
spark.sql(" select distinct(FirstName) from student_data ").show()

+---------+
|FirstName|
+---------+
|     Bide|
|     Jack|
|     Rock|
|      Joe|
|    Krish|
|      Bob|
|     John|
|     Joie|
|     Hash|
|     Dibb|
|    Biden|
+---------+

In [156]:
# Q7: Write a sql query to show unique first_name and last_name
spark.sql(" select distinct FirstName, LastName from student_data ").show()

+---------+--------+
|FirstName|LastName|
+---------+--------+
|      Bob|    Kent|
|     Dibb|    Dull|
|     Bide|     Tom|
|     John|     Die|
|    Biden|  Dirich|
|     Joie|    Anti|
|      Joe|   Kidde|
|     Rock| Johnson|
|    Krish|     Roy|
|     Jack|      Ma|
|     Hash|   Kient|
+---------+--------+

### Use of limit

In [157]:
# Q1: write an sql query to print first five rows 
spark.sql(" select * from student_data limit 5 ").show()

+---+---------+--------+----------+
| ID|FirstName|LastName|   Address|
+---+---------+--------+----------+
| 34|      Joe|   Kidde| Amsterdam|
| 14|     Bide|     Tom|Kelifornia|
|  4|     Jack|      Ma|  Oklahoma|
| 24|     Dibb|    Dull|  New York|
| 54|      Bob|    Kent|Kelifornia|
+---+---------+--------+----------+

In [158]:
# Q2: write an sql query to print first 3 persons data
spark.sql(" select * from student_data limit 3 ").show()

+---+---------+--------+----------+
| ID|FirstName|LastName|   Address|
+---+---------+--------+----------+
| 34|      Joe|   Kidde| Amsterdam|
| 14|     Bide|     Tom|Kelifornia|
|  4|     Jack|      Ma|  Oklahoma|
+---+---------+--------+----------+

In [159]:
# Q3: write an sql query to show 6 to 10 data
spark.sql(" select * from student_data limit 10 ").show()

+---+---------+--------+----------+
| ID|FirstName|LastName|   Address|
+---+---------+--------+----------+
| 34|      Joe|   Kidde| Amsterdam|
| 14|     Bide|     Tom|Kelifornia|
|  4|     Jack|      Ma|  Oklahoma|
| 24|     Dibb|    Dull|  New York|
| 54|      Bob|    Kent|Kelifornia|
| 44|     Hash|   Kient| Manhattan|
| 74|     Joie|    Anti|New Jersey|
| 84|    Biden|  Dirich|    Alaska|
|  4|    Krish|     Roy|Birmingham|
| 94|     Rock| Johnson|    London|
+---+---------+--------+----------+

### Calling with fully qualified name

In [160]:
# Q1: write an sql query to show FirstName with fully qualified name
spark.sql(" select student_data.FirstName from student_data ").show()

+---------+
|FirstName|
+---------+
|      Joe|
|     Bide|
|     Jack|
|     Dibb|
|      Bob|
|     Hash|
|     Joie|
|    Biden|
|    Krish|
|     Rock|
|     John|
+---------+

In [161]:
# Q2: write an sql query to show five LastName and Address
spark.sql(" select student_data.LastName, student_data.Address from student_data limit 5 ").show()

+--------+----------+
|LastName|   Address|
+--------+----------+
|   Kidde| Amsterdam|
|     Tom|Kelifornia|
|      Ma|  Oklahoma|
|    Dull|  New York|
|    Kent|Kelifornia|
+--------+----------+

### Sorting

In [162]:
# Q1: write an sql query to show FirstName with sorting
spark.sql(" select FirstName from student_data order by ID ").show()

+---------+
|FirstName|
+---------+
|     Jack|
|    Krish|
|     Bide|
|     Dibb|
|      Joe|
|     Hash|
|      Bob|
|     Joie|
|    Biden|
|     Rock|
|     John|
+---------+

In [163]:
# Q2: Write an sql query to show FirstName, address and sort with first_name
spark.sql(" select FirstName, Address from student_data order by FirstName ").show()

+---------+----------+
|FirstName|   Address|
+---------+----------+
|     Bide|Kelifornia|
|    Biden|    Alaska|
|      Bob|Kelifornia|
|     Dibb|  New York|
|     Hash| Manhattan|
|     Jack|  Oklahoma|
|      Joe| Amsterdam|
|     John|    8Dhaka|
|     Joie|New Jersey|
|    Krish|Birmingham|
|     Rock|    London|
+---------+----------+

In [164]:
# Q3: Write an sql query to show FirstName, address and sort with ID
spark.sql(" select FirstName, Address from student_data order by ID ").show()

+---------+----------+
|FirstName|   Address|
+---------+----------+
|     Jack|  Oklahoma|
|    Krish|Birmingham|
|     Bide|Kelifornia|
|     Dibb|  New York|
|      Joe| Amsterdam|
|     Hash| Manhattan|
|      Bob|Kelifornia|
|     Joie|New Jersey|
|    Biden|    Alaska|
|     Rock|    London|
|     John|    8Dhaka|
+---------+----------+

In [165]:
# Q4: Write an sql query to show FirstName, address and descending sort with ID
spark.sql(" select FirstName, Address from student_data order by ID desc ").show()

+---------+----------+
|FirstName|   Address|
+---------+----------+
|     John|    8Dhaka|
|     Rock|    London|
|    Biden|    Alaska|
|     Joie|New Jersey|
|      Bob|Kelifornia|
|     Hash| Manhattan|
|      Joe| Amsterdam|
|     Dibb|  New York|
|     Bide|Kelifornia|
|     Jack|  Oklahoma|
|    Krish|Birmingham|
+---------+----------+

In [166]:
# Q5: Write an sql query to show FirstName, address and ascending sort with ID
spark.sql(" select FirstName, Address from student_data order by ID asc ").show()

+---------+----------+
|FirstName|   Address|
+---------+----------+
|     Jack|  Oklahoma|
|    Krish|Birmingham|
|     Bide|Kelifornia|
|     Dibb|  New York|
|      Joe| Amsterdam|
|     Hash| Manhattan|
|      Bob|Kelifornia|
|     Joie|New Jersey|
|    Biden|    Alaska|
|     Rock|    London|
|     John|    8Dhaka|
+---------+----------+

In [167]:
# Q6: Write an sql query to show FirstName, address and ascending sort with ID, take 5
spark.sql(" select FirstName, Address from student_data order by ID asc limit 5").show()

+---------+----------+
|FirstName|   Address|
+---------+----------+
|     Jack|  Oklahoma|
|    Krish|Birmingham|
|     Bide|Kelifornia|
|     Dibb|  New York|
|      Joe| Amsterdam|
+---------+----------+

In [168]:
# Q7: Write an sql query to show FirstName, address and descending sort with ID, limit 3
spark.sql(" select FirstName, Address from student_data order by ID desc limit 3").show()

+---------+-------+
|FirstName|Address|
+---------+-------+
|     John| 8Dhaka|
|     Rock| London|
|    Biden| Alaska|
+---------+-------+

### Use of where

In [169]:
# Q1: write an sql query to show first_name, address where id=14
spark.sql(" select FirstName, Address from student_data where ID=14 ").show()

+---------+----------+
|FirstName|   Address|
+---------+----------+
|     Bide|Kelifornia|
+---------+----------+

In [170]:
# Q2: write and sql query to show id, last_name and address where id>50
spark.sql(" select ID, LastName, Address from student_data where ID>50 ").show()

+---+--------+----------+
| ID|LastName|   Address|
+---+--------+----------+
| 54|    Kent|Kelifornia|
| 74|    Anti|New Jersey|
| 84|  Dirich|    Alaska|
| 94| Johnson|    London|
|104|     Die|    8Dhaka|
+---+--------+----------+

### Use of between, and

In [171]:
# Q1: write an sql query to show id, first_name where id between 40 and 80
spark.sql(" select ID, FirstName from student_data where ID between 40 and 80 ").show()

+---+---------+
| ID|FirstName|
+---+---------+
| 54|      Bob|
| 44|     Hash|
| 74|     Joie|
+---+---------+

In [172]:
# Q2: write an sql query to show id, first_name where id between 40 and 80
spark.sql(" select ID, FirstName from student_data where ID between 40 and 80 ").show()

+---+---------+
| ID|FirstName|
+---+---------+
| 54|      Bob|
| 44|     Hash|
| 74|     Joie|
+---+---------+

In [173]:
# Q3: write an sql query to show id, first_name where first_name=Dibb and last_name=Dull
spark.sql(" select ID, FirstName from student_data where FirstName='Dibb' and LastName='Dull' ").show()

+---+---------+
| ID|FirstName|
+---+---------+
| 24|     Dibb|
+---+---------+

### Use of or

In [174]:
# Q1: write an sql query to show id, first_name where id=44 or id=84 and name='Biden'
spark.sql(" select ID, FirstName from student_data where (ID=44 or ID=84) and FirstName='Biden' ").show()

+---+---------+
| ID|FirstName|
+---+---------+
| 84|    Biden|
+---+---------+

In [175]:
# Q2: write and sql query to show First_name, Last_name ID=74 or ID=54 or ID=94 and Last_name='Kent'
spark.sql(" select FirstName, LastName from student_data where (ID=74 or ID=54 or ID=94) and LastName='Kent' ").show()

+---------+--------+
|FirstName|LastName|
+---------+--------+
|      Bob|    Kent|
+---------+--------+

In [176]:
# Q3: write an sql query to show first_name, id, last_name where ID between 30 to 70 or id=84 and last_name='Kient' 
spark.sql(" select FirstName, ID, LastName from student_data where ((ID between 30 and 70) or ID=112) and LastName='Kient' ").show()

+---------+---+--------+
|FirstName| ID|LastName|
+---------+---+--------+
|     Hash| 44|   Kient|
+---------+---+--------+

### Use of in, not in

In [177]:
# Q1: write an sql query to show id, first_name and address where LastName=(Anti, Tom, Dull)
spark.sql(" select ID, FirstName, Address from student_data where LastName in ('Anti', 'Tom', 'Dull') ").show()

+---+---------+----------+
| ID|FirstName|   Address|
+---+---------+----------+
| 14|     Bide|Kelifornia|
| 24|     Dibb|  New York|
| 74|     Joie|New Jersey|
+---+---------+----------+

In [178]:
# Q2: write an sql query to show ID, first_name and address where last name not in (Anti, Tom, Dull)
spark.sql(" select ID, FirstName, Address from student_data where LastName not in ('Anti', 'Tom', 'Dull') ").show()

+---+---------+----------+
| ID|FirstName|   Address|
+---+---------+----------+
| 34|      Joe| Amsterdam|
|  4|     Jack|  Oklahoma|
| 54|      Bob|Kelifornia|
| 44|     Hash| Manhattan|
| 84|    Biden|    Alaska|
|  4|    Krish|Birmingham|
| 94|     Rock|    London|
|104|     John|    8Dhaka|
+---+---------+----------+

### Use of like

In [179]:
# Q1: write an sql query to show ID, first_name where last part of the address is York
spark.sql(" select ID, FirstName from student_data where Address like '%York' ").show()

+---+---------+
| ID|FirstName|
+---+---------+
| 24|     Dibb|
+---+---------+

In [180]:
# Q2: write an sql query to show ID, first_name where address have substring that is hatt
spark.sql(" select ID, FirstName from student_data where Address like '%hatt%' ").show()

+---+---------+
| ID|FirstName|
+---+---------+
| 44|     Hash|
+---+---------+

In [181]:
# Q3: write an sql query to show ID, first_name where address is 89 Dhaka
spark.sql(" select ID, FirstName from student_data where Address like '_Dhaka' ").show()

+---+---------+
| ID|FirstName|
+---+---------+
|104|     John|
+---+---------+

Note: _(underscore) take only one digit integer number like 3,5,6,7,4,3, for this % is better.